#-------------------------------------------------------------------------------
# Name:        模块2
# Purpose:
#
# Author:      王久铭
#
# Created:     18/05/2019
# Copyright:   (c) 王久铭 2019
# Licence:     <your licence>
#-------------------------------------------------------------------------------
#调入jieba库
import jieba
#除去非人名，ps：在检查后才知道哪些是非人名。
#非人名可能有点多，初始建议输出的词数在50以上，减少跑程序的次数
excludes={"时候","没有","可是","然后","我们","知道","看到","因为","如同","那个","已经","一个","突然",
"可以","一样","那些","哥哥","告诉","幻术","只是","头发","他们","就是","那么","灵力","什么","总是",
"这个","笑容","婆婆","父皇","看见","护法","听到","自己","里面","不是","面容","离开","一直","面前",
"还是","出现","梦境","之后","所以","看着","声音","觉得","为什么","天空","成为","起来","说话","白色",
"房间","表情","西方","出来","不会","开始","依然","黑色","雪城","事情","样子","凡世","全部","整个",
"长袍","任何","如果","过去","地方","所有","宫殿","帝国","而且","不能","其实","微笑","下来","只有",
"于是","占星","占星师","有着","难过","眼睛","暗杀","怎么","身上","幻雪","脸上","发现","周围","你们",
"现在","那天","结界","上面","最后","樱花","神山","甚至","身体","可能","晚上","无法","杀死","一起",
"无数","不断","也许","格外","生命","世界","地面","小孩子","火族","似乎","诡异","自由","从来","孩子",
"坐在","乌鸦","弟弟","一切","曾经","怀疑","凤凰","过来","地上","大雪","变成","旁边","眼泪","不要",
"死亡","雪花","光芒","手上","客栈","森林","巫师","蓝色","很多","这样","喜欢","感到","女子","记得",
"应该","尽头","伟大","明白","下去","还有","温暖","我会","身边","一片","最好","这里","火焰","想到",
"永远","眼中","进入","安静","见到","绝对","弥漫","以前","飞扬"}
def read_text(filename):
    #小说存在E盘中，直接用open调出
    text = open("E:\\幻城.txt", "r", encoding = "utf-8").read()
    # 删除英文字母、数字、半角和全角标点符号
    for c in "abcdefghijklmnopqrstuvwxyz"\
    "ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789"\
    " ~!@#$%^&*()_+=-`[]\{}|:\";',./<>?，。、 "\
    "《》？；’：”“【】、｛｝§=-+——）（*&……%￥#@！～·\n":
        text = text.replace(c, "")
    return text
# 统计字频
def stat_char(text):
   ##字频统计示例
   # 构造字典，以汉字为键，以其出现次数为值
    chars = {}
    for c in text:
    # 若该字符为首次出现，增加键，构造字典，以字符为键，以其出现次数为值
        chars[c] = chars.get(c, 0) + 1
        result = list(chars.items()) # 由字典构造列表
    # 以字符出现频率排序，降序
    # sort() 函数执行时，传递待排序序列的元素给用户定义的 lambda 表达式
    # lambda 表达式参数 x 接收到该元素
    # 返回该元素（元组）的第 1 项（字频统计值）作为 sort() 函数比较依据
    result.sort(key = lambda x: x[1], reverse = True)
    return result
##字频统计示例
# 验证，总字数和用字数
# 注：因文本来自网络，未经认真检查，结果可能并不准确
filename ="幻城.txt"
text = read_text(filename)
conclusion = stat_char(text)
print("总字数：", len(text))
print("用字数：", len(conclusion))
#人物名称搜索
#继续搜索
words=jieba.lcut(text)
counts={}
for word in words :
    if len(word)==1:
        continue
    else:
        counts[word]=counts.get(word,0)+1
for word in excludes:
    del(counts[word])
items = list(counts.items())
items .sort(key=lambda x:x[1],reverse=True)
#按大小排列前10的人物
print("前十人物出场次数")
for i in range (10):
    word,count =items [i]
    print("{0:<10}{1:>5}".format(word,count))